cases/compressible/omega_same/displacementSBRStress/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tref;

boundaryField
{
    aerofoil
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform $Tref;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $Tref;
        value           uniform $Tref;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
