cases/compressible/omega_same/displacementSBRStress/system/functions/yPlus
yPlus
{
    libs            ("libfieldFunctionObjects.so");
    type            yPlus;
    writeControl    adjustableRunTime;
    writeInterval   1e-2;
}
